[
  {
    "riddle": "I’m tall when I’m young, and I’m short when I’m old. What am I?",
    "answer": "Candle"
  },
  {
    "riddle": "What has keys but can’t open locks?",
    "answer": "Piano"
  },
  {
    "riddle": "What has to be broken before you can use it?",
    "answer": "Eggshell"
  },
  {
    "riddle": "The more of me you take, the more you leave behind. What am I?",
    "answer": "Footsteps"
  },
  {
    "riddle": "I’m light as a feather, yet the strongest person can’t hold me for long. What am I?",
    "answer": "Breath"
  },
  {
    "riddle": "What has many teeth but can’t bite?",
    "answer": "Comb"
  },
  {
    "riddle": "I’m always in front of you but can’t be seen. What am I?",
    "answer": "Future"
  },
  {
    "riddle": "What begins with T, ends with T, and has T in it?",
    "answer": "Teapot"
  },
  {
    "riddle": "What can travel around the world while staying in the same spot?",
    "answer": "Stamp"
  },
  {
    "riddle": "What has a neck but no head?",
    "answer": "Bottle"
  },
  {
    "riddle": "The more you take away from me, the bigger I get. What am I?",
    "answer": "Tunnel"
  },
  {
    "riddle": "What has an eye but cannot see?",
    "answer": "Needle"
  },
  {
    "riddle": "I’m found in the sky but never in the sea. What am I?",
    "answer": "Planet"
  },
  {
    "riddle": "What can run but never walks, has a bed but never sleeps?",
    "answer": "River"
  },
  {
    "riddle": "I speak without a mouth and hear without ears. I have no body, but I come alive with the wind. What am I?",
    "answer": "Echoes"
  },
  {
    "riddle": "What goes up but never comes down?",
    "answer": "Ageing"
  },
  {
    "riddle": "What can you catch but not throw?",
    "answer": "Fever"
  },
  {
    "riddle": "What has four wheels and flies?",
    "answer": "Garbage"
  },
  {
    "riddle": "I have no hands but can knock on your door. What am I?",
    "answer": "Thunder"
  },
  {
    "riddle": "What comes once in a minute, twice in a moment, but never in a thousand years?",
    "answer": "Moment"
  },
  {
    "riddle": "I’m always running but never move. What am I?",
    "answer": "Clock"
  },
  {
    "riddle": "I’m not alive, but I can grow. I don’t have lungs, but I need air. What am I?",
    "answer": "Fire"
  },
  {
    "riddle": "What belongs to you but is used more by others?",
    "answer": "Name"
  },
  {
    "riddle": "What can fill a room but takes up no space?",
    "answer": "Shadows"
  },
  {
    "riddle": "What comes down but never goes up?",
    "answer": "Rainfall"
  },
  {
    "riddle": "What has hands but can’t clap?",
    "answer": "Wristwatch"
  },
  {
    "riddle": "I fly without wings. I cry without eyes. What am I?",
    "answer": "Clouds"
  },
  {
    "riddle": "What has cities, but no houses; forests, but no trees; and rivers, but no water?",
    "answer": "Atlas"
  },
  {
    "riddle": "What gets wetter the more it dries?",
    "answer": "Towels"
  },
  {
    "riddle": "What is full of holes but still holds water?",
    "answer": "Sponge"
  },
  {
    "riddle": "What has a thumb and four fingers but isn’t alive?",
    "answer": "Gloves"
  },
  {
    "riddle": "What can be cracked, made, told, and played?",
    "answer": "Jokes"
  },
  {
    "riddle": "The more you have of me, the less you see. What am I?",
    "answer": "Darkness"
  },
  {
    "riddle": "What has a ring but no finger?",
    "answer": "Phone"
  },
  {
    "riddle": "I shrink every time I take a bath. What am I?",
    "answer": "Soap"
  },
  {
    "riddle": "What has roots but never grows?",
    "answer": "Mountain"
  },
  {
    "riddle": "I am hard as rock, but melt in water. What am I?",
    "answer": "Iceberg"
  },
  {
    "riddle": "What flies when it’s born, lies when it’s alive, and runs when it’s dead?",
    "answer": "Snowflake"
  },
  {
    "riddle": "The more you pull me, the shorter I become. What am I?",
    "answer": "Rope"
  },
  {
    "riddle": "What has a tail but no body?",
    "answer": "Comet"
  },
  {
    "riddle": "What has a face and two hands but no arms or legs?",
    "answer": "Clock"
  },
  {
    "riddle": "What breaks but never falls?",
    "answer": "Morning"
  },
  {
    "riddle": "What falls but never breaks?",
    "answer": "Night"
  },
  {
    "riddle": "What has a heart that doesn’t beat?",
    "answer": "Artichoke"
  },
  {
    "riddle": "I’m a kind of coat that can only be put on when wet. What am I?",
    "answer": "Paint"
  },
  {
    "riddle": "I can be cracked, played, or made. What am I?",
    "answer": "Record"
  },
  {
    "riddle": "What can pierce through armor but is as soft as silk?",
    "answer": "Light"
  },
  {
    "riddle": "What lives in winter but dies in summer?",
    "answer": "Snowman"
  },
  {
    "riddle": "What has ears but cannot hear?",
    "answer": "Cornfield"
  },
  {
    "riddle": "What is lighter than a feather but no one can hold for very long?",
    "answer": "Breath"
  },
  {
    "riddle": "What comes down but never touches the ground?",
    "answer": "Fog"
  },
  {
    "riddle": "What starts off dry and ends up wet?",
    "answer": "Rainfall"
  },
  {
    "riddle": "What has branches but no fruit?",
    "answer": "Library"
  },
  {
    "riddle": "What has no doors but can still be entered?",
    "answer": "Keyboard"
  }
]
